# Indexado y selección de datos

In [2]:
import numpy as np
import pandas as pd
from pathlib import Path

datapath = Path('./data')

In [4]:
dataset = pd.read_csv(datapath / 'dataset.csv', sep=',')

##### Tabla con número de observaciones de una columna

In [6]:
dataset['City'].value_counts()

New York City      50307
Los Angeles        32173
Dallas             19707
Mountain View      14219
Austin             12292
Boston              8301
Washington D.C.     8120
San Diego           4881
Name: City, dtype: int64

##### Filtrar por valor

In [7]:
dallas_city = dataset[dataset['City'] == "Dallas"]
dallas_city

       Number    City  Gender  Age   Income Illness
0           1  Dallas    Male   41  40367.0      No
1           2  Dallas    Male   54  45084.0      No
2           3  Dallas    Male   42  52483.0      No
3           4  Dallas    Male   40  40941.0      No
4           5  Dallas    Male   46  50289.0      No
...       ...     ...     ...  ...      ...     ...
19702   19703  Dallas  Female   59  30021.0      No
19703   19704  Dallas    Male   33  34643.0      No
19704   19705  Dallas    Male   33  53190.0      No
19705   19706  Dallas    Male   37  54265.0      No
19706   19707  Dallas    Male   59  51265.0      No

[19707 rows x 6 columns]

##### Filtrar por dos valores

In [9]:
dallas_female = dataset[(dataset['City']=="Dallas") & (dataset['Gender']=="Female")]
dallas_female

       Number    City  Gender  Age   Income Illness
5           6  Dallas  Female   36  50786.0      No
6           7  Dallas  Female   32  33155.0      No
9          10  Dallas  Female   30  50082.0      No
10         11  Dallas  Female   48  41524.0     Yes
13         14  Dallas  Female   42  50894.0      No
...       ...     ...     ...  ...      ...     ...
19690   19691  Dallas  Female   63  41560.0      No
19692   19693  Dallas  Female   37  47447.0      No
19699   19700  Dallas  Female   35  47129.0      No
19701   19702  Dallas  Female   48  46132.0      No
19702   19703  Dallas  Female   59  30021.0      No

[8705 rows x 6 columns]

#### loc y iloc

In [10]:
dataset.loc[1]

Number           2
City        Dallas
Gender        Male
Age             54
Income     45084.0
Illness         No
Name: 1, dtype: object

In [11]:
dataset.iloc[1]

Number           2
City        Dallas
Gender        Male
Age             54
Income     45084.0
Illness         No
Name: 1, dtype: object

###### aunque no se aprecie la diferencia está en que loc coge el índice que tu le des, en cambio iloc se fija en la posición que tu le pases, por lo tanto en un indexado de letras iloc[1] si funcionaria

In [12]:
dataset.loc[1, ['City','Age']]

City    Dallas
Age         54
Name: 1, dtype: object

#### iat

In [13]:
dataset.iat[0,4]

40367.0

###### devuelve el dato de la posición que tu indiques